<span style=color:red;font-size:60px>ASSIGNMENT</span>

<span style =color:blue;font-size:50px>PANDAS BASIC</span>

<span style =color:green>Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.</span>

Ans-

In [1]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pandas as pd

In [5]:
data=[4,8,15,16,42]
series=pd.Series(data)
print(series)

0     4
1     8
2    15
3    16
4    42
dtype: int64

<span style =color:green>Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.</span>

In [9]:
# list with 10 element
my_list=[33,55,22,33,88,56,43,12,43,65]
# Convert the list to a Pandas Series
my_series=pd.Series(my_list)
print(my_series)

0    33
1    55
2    22
3    33
4    88
5    56
6    43
7    12
8    43
9    65
dtype: int64

<span style= color:green>Q3. Create a Pandas DataFrame that contains the following data:</span>

Ans-

In [11]:
datas={
    'Name':['Alice','Bob','Claire'],
    'Age':[25,30,27],
    'Gender':['Female','Male','Female']
}

In [12]:
df1=pd.DataFrame(datas)
print(df1)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

<span style=color:green>Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.</span>

Ans-

In pandas, a DataFrame is a two-dimensional, size-mutable, and potentially heterogeneous tabular data structure with labeled axes (rows and columns). It is one of the core data structures provided by the pandas library and is designed to store and manipulate data in a way that is similar to a spreadsheet or a SQL table.

***Here are some key differences between a DataFrame and a Series:***

***Dimension--***

***Series:*** A Series is a one-dimensional array-like object that can store a single column of data with associated labels (index).

***DataFrame:*** A DataFrame is a two-dimensional data structure with both rows and columns. It can store multiple columns of data, each represented as a Series, and allows you to work with data in a tabular format.

***Data Structure--***

***Series:*** A Series is essentially a single column of data with an index. It is suitable for representing one-dimensional data.

***DataFrame:*** A DataFrame is designed to hold multiple columns of data, making it suitable for representing structured and multi-dimensional data.

In [6]:
# creating a series
import pandas as pd
lists=[22,34,32,32]
series=pd.Series(lists)
print(series)

0    22
1    34
2    32
3    32
dtype: int64

In [8]:
# creating frame
import pandas as pd
df2={
    "Name":["Losi","Quantum","Asif"],
    "Phone":[90909090,98998766,989891616],
    "Category":["data science","web dev","data analyst"]
}

In [11]:
data_frame=pd.DataFrame(df2)
print(data_frame)

      Name      Phone      Category
0     Losi   90909090  data science
1  Quantum   98998766       web dev
2     Asif  989891616  data analyst

<span style=color:green>Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?</span>

Ans-

***Pandas provides a wide range of functions and methods for manipulating data in a DataFrame. Here are some common functions and methods along with examples of when you might use them:***

In [1]:
import pandas as pd

In [2]:
# here reading
df=pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [3]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [4]:
# showing upper 4
df.head(4)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S

In [5]:
# here columns
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [7]:
# selecting specific column
df['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [8]:
# selcting many columns
df[['Age', 'SibSp']]

      Age  SibSp
0    22.0      1
1    38.0      1
2    26.0      0
3    35.0      1
4    35.0      0
..    ...    ...
886  27.0      0
887  19.0      0
888   NaN      1
889  26.0      0
890  32.0      0

[891 rows x 2 columns]

In [9]:
# showing last 3
df.tail(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

<span style=color:green>Q6. Which of the following is mutable in nature Series, DataFrame, Panel?</span>

Ans-

***In pandas, among the three main data structures, Series, DataFrame, and Panel, the DataFrame is the mutable one.***

***Series:*** A Series is immutable. Once you create a Series object, you cannot change its elements or size. You can, however, create a new Series with modified data.

***DataFrame:*** A DataFrame is mutable. You can add, remove, or modify columns and rows within a DataFrame after it's created.

***Panel:*** The Panel data structure has been deprecated in recent versions of pandas (since version 0.25.0) and is no longer actively maintained. It was designed for three-dimensional data, but in practice, it was rarely used. Users are encouraged to use DataFrame for similar purposes, and as of my knowledge cutoff date in September 2021, the Panel is considered immutable.

***Since the Panel is deprecated and not commonly used, the main mutable data structure in pandas for tabular data manipulation is the DataFrame.***

<span style=color:green>Q7. Create a DataFrame using multiple Series. Explain with an example.</span>

Ans-

In [13]:
import pandas as pd

# multiple series create
names=pd.Series(["Ossa","Yasir","Kamil"])
numbers=pd.Series([98890900000,989000000000,876768875858])
genders=pd.Series(["Male","Female","Female"])

# combine the series into dataframe
datas={
     "Name":names,
     "Number":numbers,
     "Gender":genders
}
multi_series=pd.DataFrame(datas)
print(multi_series)

    Name        Number  Gender
0   Ossa   98890900000    Male
1  Yasir  989000000000  Female
2  Kamil  876768875858  Female